# running in FullProof_bmc/src/
read_verilog -formal Formal_Proof_Module_Wrapper.sv
prep -top Formal_Proof_Module_Wrapper

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
